Revit 2024 API
FabricationPartFitResult Enumeration
 Fabrication part stretch/fill result.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public enum FabricationPartFitResult
Visual Basic
Public Enumeration FabricationPartFitResult
Visual C++
public enum class FabricationPartFitResult
Members
Member name | Description
Success |  Operation was successful.
IncompatibleGeometry |  Failed because the part didn't have the dimensions required to meet the geometry requirements.
MisalignedEnds |  Failed due to misalignment of fitting ends.
DimensionLocked |  Failed due to not being able to change a locked or product listed dimension.
BadDimensions |  Failed due to the required dimension values not being valid to fabricate.
ShapeMismatch |  Failed due to shape mismatch of fitting ends.
SizeMismatch |  Failed due to size mismatch of fitting ends.
IncompatibleConnection |  Failed due to connectors being incompatible and no couplings found to resolve it.
OffsetRequired |  Failed due to additional offset dimensions or fittings being required that weren't available.
Unsupported |  Failed due to unsupported routing path.
See Also
Autodesk.Revit.DB.Fabrication Namespace